{
  "overview": {
    "title": "Overview",
    "description": "Focusing on the compatibility and grammatical and vocabulary similarities between Japanese and Korean subtitles, I am developing a language learning site where fans can share and accumulate learning data and explanations through otaku content. Learning efficiency is possible through subtitle comparison, AI-generated explanations, progress management, and explanation sharing.",
    "disclaimer": "※ This tool is used for personal learning purposes only, privately and non-commercially."
  },
  "techStack": {
    "title": "Technology Stack",
    "items": [
      {
        "title": "Backend: Python / Django",
        "description": "I used Python because I had experience using it for YouTube subtitle analysis tools during university, and also because much YouTube-related information can be found in Python."
      },
      {
        "title": "Frontend: TypeScript / Vue.js",
        "description": "I selected Vue.js because I had no work experience with it and wanted to learn it through personal development."
      },
      {
        "title": "Database: PostgreSQL"
      },
      {
        "title": "Other Technologies: Docker / Nginx"
      }
    ]
  },
  "features": {
    "title": "Main Features",
    "items": [
      {
        "title": "Subtitle Matching Function",
        "description": "YouTube video subtitles can be compared and confirmed using subtitles in the language you want to learn and subtitles in a language you can understand."
      },
      {
        "title": "Status Setting",
        "description": "Set status for each subtitle such as \"Haven't checked content yet,\" \"Checked content but don't understand,\" \"Only one word is unclear,\" \"Fully understood,\" etc., to manage learning progress."
      },
      {
        "title": "Data List and Review Function",
        "description": "View learned data in a list and review it."
      },
      {
        "title": "Subtitle Categorization and Playlist Function",
        "description": "Manage subtitles by category and add them to playlists. Can be organized by purpose such as otaku terms and technical terms."
      },
      {
        "title": "Subtitle Translation Function",
        "description": "Provide translation for the corresponding subtitle without needing to note video playback position or subtitles, and confirm translation content."
      },
      {
        "title": "Link and Audio Learning Function",
        "description": "There is a link to the video section where the corresponding subtitle is spoken, and audio can also be confirmed. Can learn pronunciation in addition to text."
      },
      {
        "title": "Explanation Generation and Storage",
        "description": "Use generative AI to create and save grammar and vocabulary explanations."
      },
      {
        "title": "Explanation Sharing",
        "description": "Share explanations among multiple users to reduce the effort required for learning."
      }
    ]
  },
  "developmentFocus": {
    "title": "What I Focused on in Development",
    "items": [
      "Many-to-many table design",
      "Commonize and reuse processes that can be commonized for each component as much as possible",
      "Thorough two-way binding in common components",
      "Automatic document generation (ER diagrams, table definition documents)",
      "DB definition management through migrations"
    ]
  },
  "background": {
    "title": "Background",
    "paragraphs": [
      [
        "When learning foreign languages, it is known that you can naturally acquire them while enjoying yourself by utilizing content you like.",
        "In fact, many foreigners have started learning Japanese after being exposed to Japanese anime and Vocaloid otaku culture."
      ],
      [
        "In this way, Japanese people should also be able to learn foreign languages through overseas otaku content.",
        "However, currently, such learning methods require a lot of effort.",
        "For example, tasks such as listening to video audio, organizing subtitles, and looking up unknown words and expressions one by one become burdens separate from the learning itself."
      ],
      [
        "On the other hand, in today's environment where information can be shared through the internet, there is no need for everyone to do all this work alone.",
        "For example, in the field of music, when there was a song you wanted to play, you used to create sheet music by ear yourself, but now you can focus on practice by utilizing scores created by others."
      ],
      [
        "Similarly, in language learning, it is thought that by sharing and reusing information useful for learning, it becomes possible to learn more efficiently without each person having to research and organize."
      ],
      [
        "Also, audio materials often use readings by narrators, but there is also the issue that inorganic voices don't connect well to learning motivation.",
        "Therefore, creating an environment where you can learn with \"favorite voices\" like your favorite idols and VTubers is also considered one support for continuing learning."
      ],
      [
        "Based on this background, I want to develop a system that reduces the effort required to learn foreign languages using favorite YouTube content and allows users who like the same content to share information.",
        "Through this system, users can reduce time spent researching and focus more time on learning."
      ]
    ]
  }
}
