{
  "message": {
    "hello": "Hello!",
    "about": "About Me",
    "projects": "Projects",
    "skills": "Skills",
    "contact": "Contact"
  },
  "section": {
    "about": "About Me",
    "projects": "Projects",
    "skills": "Skills"
  },
  "about": {
    "intro": "Born and raised in Osaka, currently living in Tokyo.\nMajored in Information Science at the Faculty of Science and Engineering, specializing in Natural Language Processing.\nExperienced in a wide range of development, including web applications, back-end, front-end, and batch processing.\nI've been interested in NLP since my student days and am currently developing a language learning app that leverages YouTube subtitles and generative AI.",
    "interest": {
      "title": "Interests:",
      "nlp": "Natural Language Processing",
      "genai": "Generative AI",
      "lang": "Languages",
      "illust": "Digital Illustration",
      "vtuber": "VTuber"
    }
  },
  "projects": {
    "ytgenai": {
      "catch": "Multilingual Learning Support Web App Using YouTube Subtitles and Generative AI",
      "summaryLabel": "Summary:",
      "desc": "Developing a language learning website focusing on the affinity and similarity between Japanese and Korean subtitles, allowing fans to share and accumulate learning data and commentary through otaku content.",
      "stack": [
        { "title": "Tech Stack" },
        {
          "name": "Back-End: Python (Django)",
          "reason": "I used Python to develop a YouTube subtitle analysis tool during university, and since most YouTube-related information is available in Python, I chose to use it for this project."
        },
        {
          "name": "Front-End: TypeScript, Vue.js",
          "reason": "Chose Vue.js to gain experience through personal development, as it was not used in my professional work."
        },
        { "name": "Database: PostgreSQL" },
        { "name": "Others: Docker, Nginx" }
      ]
    }
  },
  "accordion": {
    "open": "View Details",
    "close": "Hide Details"
  },
  "skills": {
    "languages": "Programming Languages",
    "languagesList": [
      {
        "name": "Java",
        "detail": "Extensive experience in back-end and batch processing, mainly using Spring Boot. Primarily used in professional work."
      },
      {
        "name": "TypeScript",
        "detail": "Developed admin dashboards using Vue.js at work, also used in personal projects."
      },
      {
        "name": "Python",
        "detail": "Used widely for personal projects and scripting."
      },
      {
        "name": "Rust",
        "detail": "Used in back-end development at work. Currently continuing to learn."
      }
    ],
    "databases": "Databases",
    "databasesList": [
      {
        "name": "PostgreSQL",
        "detail": "Used in both professional and personal development. Proficient in basic SQL operations."
      },
      {
        "name": "Oracle / MySQL",
        "detail": "Basic operational experience through work."
      }
    ],
    "infra": "Infrastructure & Tools",
    "infraList": [
      {
        "name": "Docker",
        "detail": "Capable of building basic development environments."
      },
      {
        "name": "AWS",
        "detail": "Experience with basic services; currently studying more advanced usage."
      }
    ],
    "languageskill": "Language Skills",
    "languageskillList": [
      {
        "name": "Japanese",
        "summary": "Native. Fluent.",
        "detail": "Native Japanese speaker."
      },
      {
        "name": "Korean",
        "summary": "Able to engage in simple conversations and self-introductions. Continuously self-studying.",
        "detail": "Learned Korean as a second foreign language in university. Later rekindled interest due to the virtual idol group '이세계아이돌'. Attracted by the similarities between Korean and Japanese grammar and vocabulary, and the ease of learning through subtitles. Studying through YouTube, VRChat, and Maum. Can handle light conversations and introductions. Familiar with Hangul reading and pronunciation, though vocabulary is limited and skewed toward otaku terms."
      },
      {
        "name": "Chinese",
        "summary": "Can understand basic daily expressions. Currently learning pronunciation and conversation.",
        "detail": "Studying for a few months. Can read some pinyin, but still struggling with accurate pronunciation. Practicing through Hello Talk with Chinese friends who speak Japanese. Understanding simple phrases like 'go to work' or 'eat a meal' is improving. Reading is getting better, but speaking, listening, and writing remain areas to improve. Learning vocabulary around HSK Level 4 and trying to output through conversation."
      },
      {
        "name": "English",
        "summary": "Mainly focused on listening and getting used to English environments.",
        "detail": "Started learning English in junior high school but didn't study seriously at the time. Currently exposed to English mainly through listening, inspired by English VTubers such as NIJISANJI EN. Although not studying systematically, aiming to improve understanding gradually through content I enjoy."
      }
    ]
  }
}
