{
  "overview": {
    "title": "概要",
    "description": "日本語と韓国語の字幕における相性の良さや文法や単語の類似性に着目し、オタクコンテンツを通じてファン同士が学習データや解説を共有・蓄積できる語学学習サイトを開発しています。字幕の比較、AIによる解説生成、進捗管理、解説の共有など、学習の効率化が可能です。",
    "disclaimer": "※ 本ツールは個人の学習用途に限り、非公開・非商用で使用しています。"
  },
  "techStack": {
    "title": "技術スタック",
    "items": [
      {
        "title": "バックエンド: Python / Django",
        "description": "大学時代にYouTube字幕分析ツールでPythonを使用した経験があり、またYouTube関連の情報がPythonで多く見つかるため使用。"
      },
      {
        "title": "フロントエンド: TypeScript / Vue.js",
        "description": "Vue.jsは業務未経験だったため、個人開発での習得を目的に選定。"
      },
      {
        "title": "データベース: PostgreSQL"
      },
      {
        "title": "その他技術: Docker / Nginx"
      }
    ]
  },
  "features": {
    "title": "主な機能",
    "items": [
      {
        "title": "字幕照合機能",
        "description": "YouTubeの動画字幕を、学習したい言語の字幕と自分が理解できる言語の字幕で比較しながら確認可能。"
      },
      {
        "title": "ステータス設定",
        "description": "「まだ内容を確認していない」「内容を確認したが理解できていない」「一つだけ単語がわからない」「完全に理解した」などのステータスを字幕ごとに設定し、学習の進捗を管理。"
      },
      {
        "title": "データ一覧と復習機能",
        "description": "学習したデータを一覧で確認し、復習ができる。"
      },
      {
        "title": "字幕カテゴリ分け・プレイリスト機能",
        "description": "字幕をカテゴリごとに管理し、プレイリストに追加可能。オタク用語や専門用語など目的に合わせて整理できる。"
      },
      {
        "title": "字幕翻訳機能",
        "description": "動画の再生位置や字幕をメモる必要なく、該当字幕の翻訳を提供し、翻訳内容を確認可能。"
      },
      {
        "title": "リンクと音声学習機能",
        "description": "該当字幕が話されている動画部分へのリンクがあり、音声も確認可能。テキストだけでなく発音の学習もできる。"
      },
      {
        "title": "解説の生成と保存",
        "description": "生成AIを活用して文法や単語の解説を作成し、保存できる。"
      },
      {
        "title": "解説の共有",
        "description": "複数のユーザー間で解説を共有し、学習にかかる労力を軽減できる。"
      }
    ]
  },
  "developmentFocus": {
    "title": "開発で意識したこと",
    "items": [
      "多対多のテーブル設計",
      "部品ごとに共通化できる処理は、可能な限り共通化し再利用",
      "共通コンポーネントでは双方向バインディングを徹底",
      "ドキュメントの自動生成（ER図、テーブル定義書）",
      "マイグレーションによるDB定義の管理"
    ]
  },
  "background": {
    "title": "背景",
    "paragraphs": [
      [
        "外国語を学ぶ際、好きなコンテンツを活用することで、楽しみながら自然に習得できることが知られています。",
        "実際、日本のアニメやボカロといったオタク文化に触れたことをきっかけに、日本語を学び始めた外国人も少なくありません。"
      ],
      [
        "このように、日本人もまた、海外のオタクコンテンツを通じて外国語を学ぶことができるはずです。",
        "しかし現状では、その学習方法には多くの労力がかかるという課題があります。",
        "たとえば、動画から音声を聞き取り、字幕を整え、わからない単語や表現を一つずつ調べるといった作業は、学習そのものとは別の負担になってしまいます。"
      ],
      [
        "一方で、インターネットを通じて情報を共有できる環境が整った現在では、こうした作業をすべて一人で行う必要はありません。",
        "たとえば音楽の分野では、かつては演奏したい曲があると、自分で耳コピをして楽譜を作成していましたが、今では他の誰かが作成した譜面を活用することで、演奏の練習に集中できるようになっています。"
      ],
      [
        "同様に、言語学習においても、学習に役立つ情報を共有・再利用することで、一人ひとりが調査や整理を行わなくても、より効率的に学ぶことが可能になると考えられます。"
      ],
      [
        "また、音声教材ではナレーターによる朗読が使われることが多いですが、無機質な声では学習のモチベーションにつながりにくいという課題もあります。",
        "そこで、推しのアイドルやVTuberといった「好きな声」で学習できる環境を整えることも、学習を続けるための一つの支えになると考えています。"
      ],
      [
        "このような背景をもとに、私は、好きなYouTubeコンテンツを使って外国語を学ぶ際の手間を減らし、同じコンテンツを好むユーザー同士が情報を共有できるシステムを開発したいと考えています。",
        "このシステムによって、ユーザーは調べる時間を減らし、より多くの時間を学習に集中できるようになります。"
      ]
    ]
  }
}
