{
  "overview": {
    "title": "개요",
    "description": "일본어와 한국어 자막의 상성과 문법 및 단어의 유사성에 주목하여, 오타쿠 콘텐츠를 통해 팬들이 학습 데이터와 해설을 공유하고 축적할 수 있는 어학 학습 사이트를 개발하고 있습니다. 자막 비교, AI 해설 생성, 진행 관리, 해설 공유 등을 통해 학습 효율화가 가능합니다.",
    "disclaimer": "※ 본 도구는 개인 학습 용도로만 비공개·비상업적으로 사용하고 있습니다."
  },
  "techStack": {
    "title": "기술 스택",
    "items": [
      {
        "title": "백엔드: Python / Django",
        "description": "대학 시절 YouTube 자막 분석 도구로 Python을 사용한 경험이 있고, 또한 YouTube 관련 정보가 Python에서 많이 발견되기 때문에 사용."
      },
      {
        "title": "프론트엔드: TypeScript / Vue.js",
        "description": "Vue.js는 업무 미경험이었기 때문에, 개인 개발에서의 습득을 목적으로 선정."
      },
      {
        "title": "데이터베이스: PostgreSQL"
      },
      {
        "title": "기타 기술: Docker / Nginx"
      }
    ]
  },
  "features": {
    "title": "주요 기능",
    "items": [
      {
        "title": "자막 대조 기능",
        "description": "YouTube 동영상 자막을, 학습하고 싶은 언어의 자막과 자신이 이해할 수 있는 언어의 자막으로 비교하면서 확인 가능."
      },
      {
        "title": "상태 설정",
        "description": "\"아직 내용을 확인하지 않았다\" \"내용을 확인했지만 이해하지 못한다\" \"하나만 단어가 모른다\" \"완전히 이해했다\" 등의 상태를 자막마다 설정하여 학습의 진행을 관리."
      },
      {
        "title": "데이터 목록과 복습 기능",
        "description": "학습한 데이터를 목록으로 확인하고 복습할 수 있다."
      },
      {
        "title": "자막 카테고리 분류·플레이리스트 기능",
        "description": "자막을 카테고리별로 관리하고 플레이리스트에 추가 가능. 오타쿠 용어나 전문 용어 등 목적에 맞춰 정리할 수 있다."
      },
      {
        "title": "자막 번역 기능",
        "description": "동영상의 재생 위치나 자막을 메모할 필요 없이, 해당 자막의 번역을 제공하고 번역 내용을 확인 가능."
      },
      {
        "title": "링크와 음성 학습 기능",
        "description": "해당 자막이 말해지는 동영상 부분으로의 링크가 있고 음성도 확인 가능. 텍스트뿐만 아니라 발음의 학습도 할 수 있다."
      },
      {
        "title": "해설의 생성과 저장",
        "description": "생성 AI를 활용하여 문법이나 단어의 해설을 작성하고 저장할 수 있다."
      },
      {
        "title": "해설의 공유",
        "description": "복수의 사용자 간에 해설을 공유하여 학습에 드는 노력을 경감할 수 있다."
      }
    ]
  },
  "developmentFocus": {
    "title": "개발에서 의식한 것",
    "items": [
      "다대다 테이블 설계",
      "부품마다 공통화할 수 있는 처리는 가능한 한 공통화하여 재이용",
      "공통 컴포넌트에서는 양방향 바인딩을 철저히",
      "문서의 자동 생성 (ER도, 테이블 정의서)",
      "마이그레이션에 의한 DB 정의의 관리"
    ]
  },
  "background": {
    "title": "배경",
    "paragraphs": [
      [
        "외국어를 배울 때, 좋아하는 콘텐츠를 활용함으로써 즐거움을 느끼면서 자연스럽게 습득할 수 있다는 것이 알려져 있습니다.",
        "실제로, 일본의 애니메이션이나 보카로와 같은 오타쿠 문화를 통해 일본어를 공부하고 있는 외국인도 적지 않습니다."
      ],
      [
        "이처럼, 일본인도 또한 해외의 오타쿠 콘텐츠를 통해 외국어를 배울 수 있을 것입니다.",
        "그러나 현재 상황에서는 그 학습 방법에 많은 노력이 든다는 과제가 있습니다.",
        "예를 들어, 동영상에서 음성을 듣고 자막을 정리하고, 모르는 단어나 표현을 하나씩 조사하는 등의 작업은 학습 그 자체와는 별개의 부담이 되어 버립니다."
      ],
      [
        "한편으로, 인터넷을 통해 정보를 공유할 수 있는 환경이 갖춰진 현재에서는 이런 작업을 모두 혼자서 할 필요는 없습니다.",
        "예를 들어 음악 분야에서는, 예전에는 연주하고 싶은 곡이 있으면 자신이 귀로 따라해서 악보를 만들었지만, 지금은 다른 누군가가 만든 악보를 활용함으로써 연주의 연습에 집중할 수 있게 되었습니다."
      ],
      [
        "마찬가지로, 언어 학습에서도 학습에 도움이 되는 정보를 공유·재활용함으로써 각자가 조사나 정리를 하지 않아도 더욱 효율적으로 배울 수 있다고 생각됩니다."
      ],
      [
        "또한, 음성 교재에서는 내레이터에 의한 낭독이 사용되는 경우가 많지만, 무기질한 목소리로는 학습의 동기 부여에 연결되기 어렵다는 과제도 있습니다.",
        "따라서, 좋아하는 아이돌이나 VTuber와 같은 \"좋아하는 목소리\"로 학습할 수 있는 환경을 갖추는 것도 학습을 계속하기 위한 하나의 지원이 된다고 생각합니다."
      ],
      [
        "이러한 배경을 바탕으로, 저는 좋아하는 YouTube 콘텐츠를 사용해서 외국어를 배울 때의 번거로움을 줄이고, 같은 콘텐츠를 좋아하는 사용자끼리 정보를 공유할 수 있는 시스템을 개발하고 싶다고 생각합니다.",
        "이 시스템에 의해 사용자는 조사하는 시간을 줄이고 더 많은 시간을 학습에 집중할 수 있게 됩니다."
      ]
    ]
  }
}
