{
  "overview": {
    "title": "개요",
    "description": "일본어와 한국어 자막의 상성과 문법 및 단어의 유사성에 주목하여, 오타쿠 콘텐츠를 통해 팬들이 학습 데이터와 해설을 공유하고 축적할 수 있는 어학 학습 사이트를 개발하고 있습니다. 자막 비교, AI 해설 생성, 진행 관리, 해설 공유 등을 통해 학습 효율화가 가능합니다.",
    "disclaimer": "※ 본 도구는 개인 학습 용도로만 비공개·비상업적으로 사용하고 있습니다."
  },
  "techStack": {
    "title": "기술 스택",
    "items": [
      {
        "title": "백엔드: Python / Django",
        "description": "대학 시절 YouTube 자막 분석 도구로 Python을 사용한 경험이 있고, 또한 YouTube 관련 정보가 Python에서 많이 발견되기 때문에 사용."
      },
      {
        "title": "프론트엔드: TypeScript / Vue.js",
        "description": "Vue.js는 업무 미경험이었기 때문에, 개인 개발에서의 습득을 목적으로 선정."
      },
      {
        "title": "데이터베이스: PostgreSQL"
      },
      {
        "title": "기타 기술: Docker / Nginx"
      }
    ]
  },
  "features": {
    "title": "주요 기능",
    "items": [
      {
        "title": "자막 대조 기능",
        "description": "YouTube 동영상 자막을, 학습하고 싶은 언어의 자막과 자신이 이해할 수 있는 언어의 자막으로 비교하면서 확인 가능."
      },
      {
        "title": "상태 설정",
        "description": "\"아직 내용을 확인하지 않았다\" \"내용을 확인했지만 이해하지 못한다\" \"하나만 단어가 모른다\" \"완전히 이해했다\" 등의 상태를 자막마다 설정하여 학습의 진행을 관리."
      },
      {
        "title": "데이터 목록과 복습 기능",
        "description": "학습한 데이터를 목록으로 확인하고 복습할 수 있다."
      },
      {
        "title": "자막 카테고리 분류·플레이리스트 기능",
        "description": "자막을 카테고리별로 관리하고 플레이리스트에 추가 가능. 오타쿠 용어나 전문 용어 등 목적에 맞춰 정리할 수 있다."
      },
      {
        "title": "자막 번역 기능",
        "description": "동영상의 재생 위치나 자막을 메모할 필요 없이, 해당 자막의 번역을 제공하고 번역 내용을 확인 가능."
      },
      {
        "title": "링크와 음성 학습 기능",
        "description": "해당 자막이 말해지는 동영상 부분으로의 링크가 있고 음성도 확인 가능. 텍스트뿐만 아니라 발음의 학습도 할 수 있다."
      },
      {
        "title": "해설의 생성과 저장",
        "description": "생성 AI를 활용하여 문법이나 단어의 해설을 작성하고 저장할 수 있다."
      },
      {
        "title": "해설의 공유",
        "description": "복수의 사용자 간에 해설을 공유하여 학습에 드는 노력을 경감할 수 있다."
      }
    ]
  },
  "developmentFocus": {
    "title": "개발에서 의식한 것",
    "items": [
      "다대다 테이블 설계",
      "부품마다 공통화할 수 있는 처리는 가능한 한 공통화하여 재이용",
      "공통 컴포넌트에서는 양방향 바인딩을 철저히",
      "문서의 자동 생성 (ER도, 테이블 정의서)",
      "마이그레이션에 의한 DB 정의의 관리"
    ]
  },
  "background": {
    "title": "배경",
    "paragraphs": [
      "외국어를 배울 때, 많은 사람이 흥미를 가지는 콘텐츠를 이용하여 학습함으로써 효율적으로 자연스럽게 습득할 수 있다.",
      "예를 들어, 일본의 애니메이션이나 보카로와 같은 오타쿠 콘텐츠에 접함으로써 일본어를 자연스럽게 습득하는 외국인도 많이 보인다.",
      "일본인도 마찬가지로, 해외의 오타쿠 콘텐츠를 통해 외국어를 배울 수 있다고 생각된다.",
      "그러나 현상황에서 이런 방법에는 많은 노력이 필요하다.",
      "특히, 동영상의 음성을 듣고 자막을 정리하거나, 모르는 단어나 표현을 하나씩 조사하는 작업이 필요하여 학습의 번거로움이 커진다.",
      "한편으로, 인터넷의 보급으로 특정 콘텐츠에 관한 정보를 공유하거나, 다른 사람이 만든 자료를 이용하는 것이 용이해지고 있다.",
      "예를 들어, 음악의 분야에서는, 예전에는 악기로 연주하고 싶은 곡이 있었을 경우 그 곡을 귀로 따라해서 악보를 만들었지만, 현재에서는 다른 누군가가 만든 악보를 이용할 수 있게 되어 그만큼 연주의 연습에 집중할 수 있게 되었다.",
      "마찬가지로, 언어 학습에서도 모르는 것을 조사하는 작업을 모두가 할 필요는 없고, 한 번 누군가가 만든 자료를 공유함으로써 학습 효율을 대폭 향상시킬 수 있다.",
      "또한, 외국어 학습에는 음성이 포함된 교과서가 자주 사용되지만, 음성은 무명의 내레이터에 의한 것이 많아 학습자의 동기 부여에 연결되기 어려운 과제가 있다.",
      "그 때문에, 좋아하는 아이돌이나 VTuber 등, 좋아하는 목소리로 학습할 수 있도록 하고 싶다고 생각한다.",
      "이런 배경에서, 좋아하는 YouTube 콘텐츠를 이용하여 외국어를 배울 때의 노력을 경감하고, 같은 콘텐츠를 좋아하는 사람끼리 정보를 공유함으로써 효율적으로 학습을 진행할 수 있는 시스템을 개발하고 싶다고 생각한다.",
      "이 시스템에 의해, 사용자는 조사하는 번거로움을 생략하고 더 많은 시간을 실제 학습에 사용할 수 있다."
    ]
  }
}
